Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 768, 1024, 3 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 768, 1024, 12 156         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 768, 1024, 12 48          conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 768, 1024, 12 48          input_1[0][0]                    
__________________________________________________________________________________________________
activation (Activation)         (None, 768, 1024, 12 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 768, 1024, 12 48          conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 768, 1024, 12 588         activation[0][0]                 
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 768, 1024, 12 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
add (Add)                       (None, 768, 1024, 12 0           conv2d_1[0][0]                   
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
dropout (Dropout)               (None, 768, 1024, 12 0           add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 768, 1024, 12 48          dropout[0][0]                    
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 768, 1024, 12 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 384, 512, 24) 14136       activation_2[0][0]               
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 384, 512, 24) 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 384, 512, 24) 96          dropout_1[0][0]                  
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 384, 512, 24) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 192, 256, 48) 56496       activation_3[0][0]               
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 192, 256, 48) 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 192, 256, 48) 192         dropout_2[0][0]                  
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 192, 256, 48) 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 96, 128, 96)  225888      activation_4[0][0]               
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 96, 128, 96)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 96, 128, 96)  384         dropout_3[0][0]                  
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 96, 128, 96)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 48, 64, 192)  903360      activation_5[0][0]               
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 48, 64, 192)  0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 48, 64, 192)  768         dropout_4[0][0]                  
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 48, 64, 192)  0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 48, 64, 192)  1806528     activation_6[0][0]               
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 48, 64, 192)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 48, 64, 192)  768         dropout_5[0][0]                  
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 48, 64, 192)  0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 48, 64, 192)  1806528     activation_7[0][0]               
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 96, 128, 192) 0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 96, 128, 288) 0           up_sampling2d[0][0]              
                                                                 conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 96, 128, 288) 1152        concatenate[0][0]                
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 96, 128, 288) 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 96, 128, 192) 2709696     activation_8[0][0]               
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 192, 256, 192 0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 192, 256, 240 0           up_sampling2d_1[0][0]            
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 192, 256, 240 960         concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 192, 256, 240 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 192, 256, 96) 1129056     activation_9[0][0]               
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 384, 512, 96) 0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 384, 512, 120 0           up_sampling2d_2[0][0]            
                                                                 conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 384, 512, 120 480         concatenate_2[0][0]              
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 384, 512, 120 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 384, 512, 48) 282288      activation_10[0][0]              
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 768, 1024, 48 0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 768, 1024, 60 0           up_sampling2d_3[0][0]            
                                                                 add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 768, 1024, 60 240         concatenate_3[0][0]              
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 768, 1024, 60 0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 768, 1024, 24 70584       activation_11[0][0]              
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 768, 1024, 2) 50          conv2d_12[0][0]                  
==================================================================================================
Total params: 9,010,586
Trainable params: 9,007,994
Non-trainable params: 2,592
__________________________________________________________________________________________________
