Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 768, 1024, 3 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 768, 1024, 4) 52          input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 768, 1024, 4) 16          conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 768, 1024, 4) 16          input_1[0][0]                    
__________________________________________________________________________________________________
activation (Activation)         (None, 768, 1024, 4) 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 768, 1024, 4) 16          conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 768, 1024, 4) 68          activation[0][0]                 
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 768, 1024, 4) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
add (Add)                       (None, 768, 1024, 4) 0           conv2d_1[0][0]                   
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
dropout (Dropout)               (None, 768, 1024, 4) 0           add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 768, 1024, 4) 16          dropout[0][0]                    
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 768, 1024, 4) 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 384, 512, 8)  1576        activation_2[0][0]               
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 384, 512, 8)  0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 384, 512, 8)  40          add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 384, 512, 8)  32          dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 384, 512, 8)  32          conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 384, 512, 8)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 384, 512, 8)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 384, 512, 8)  3144        activation_3[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, 384, 512, 8)  0           activation_4[0][0]               
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 384, 512, 8)  0           add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 384, 512, 8)  32          dropout_2[0][0]                  
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 384, 512, 8)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 192, 256, 16) 6288        activation_5[0][0]               
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 192, 256, 16) 0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 192, 256, 16) 144         add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 192, 256, 16) 64          dropout_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 192, 256, 16) 64          conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 192, 256, 16) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 192, 256, 16) 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 192, 256, 16) 12560       activation_6[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, 192, 256, 16) 0           activation_7[0][0]               
                                                                 conv2d_7[0][0]                   
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 192, 256, 16) 0           add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 192, 256, 16) 64          dropout_4[0][0]                  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 192, 256, 16) 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 96, 128, 32)  25120       activation_8[0][0]               
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 96, 128, 32)  0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 96, 128, 32)  544         add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 96, 128, 32)  128         dropout_5[0][0]                  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 96, 128, 32)  128         conv2d_11[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 96, 128, 32)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 96, 128, 32)  0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 96, 128, 32)  50208       activation_9[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, 96, 128, 32)  0           activation_10[0][0]              
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 96, 128, 32)  0           add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 96, 128, 32)  128         dropout_6[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 96, 128, 32)  0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 48, 64, 64)   100416      activation_11[0][0]              
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 48, 64, 64)   0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 48, 64, 64)   2112        add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 48, 64, 64)   256         dropout_7[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 48, 64, 64)   256         conv2d_14[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 48, 64, 64)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 48, 64, 64)   0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 48, 64, 64)   200768      activation_12[0][0]              
__________________________________________________________________________________________________
add_4 (Add)                     (None, 48, 64, 64)   0           activation_13[0][0]              
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 48, 64, 64)   0           add_4[0][0]                      
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 48, 64, 64)   256         dropout_8[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 48, 64, 64)   0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 48, 64, 64)   200768      activation_14[0][0]              
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 48, 64, 64)   0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 48, 64, 64)   256         dropout_9[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 48, 64, 64)   0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 48, 64, 64)   200768      activation_15[0][0]              
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 96, 128, 64)  0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 96, 128, 96)  0           up_sampling2d[0][0]              
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 96, 128, 96)  384         concatenate[0][0]                
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 96, 128, 96)  0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 96, 128, 64)  301120      activation_16[0][0]              
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 96, 128, 64)  6208        concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 96, 128, 64)  256         conv2d_17[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 96, 128, 64)  256         conv2d_19[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 96, 128, 64)  0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 96, 128, 64)  0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 96, 128, 64)  200768      activation_17[0][0]              
__________________________________________________________________________________________________
add_5 (Add)                     (None, 96, 128, 64)  0           activation_18[0][0]              
                                                                 conv2d_18[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 192, 256, 64) 0           add_5[0][0]                      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 192, 256, 80) 0           up_sampling2d_1[0][0]            
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 192, 256, 80) 320         concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 192, 256, 80) 0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 192, 256, 32) 125472      activation_19[0][0]              
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 192, 256, 32) 2592        concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 192, 256, 32) 128         conv2d_20[0][0]                  
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 192, 256, 32) 128         conv2d_22[0][0]                  
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 192, 256, 32) 0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 192, 256, 32) 0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 192, 256, 32) 50208       activation_20[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 192, 256, 32) 0           activation_21[0][0]              
                                                                 conv2d_21[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 384, 512, 32) 0           add_6[0][0]                      
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 384, 512, 40) 0           up_sampling2d_2[0][0]            
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 384, 512, 40) 160         concatenate_2[0][0]              
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 384, 512, 40) 0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 384, 512, 16) 31376       activation_22[0][0]              
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 384, 512, 16) 656         concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 384, 512, 16) 64          conv2d_23[0][0]                  
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 384, 512, 16) 64          conv2d_25[0][0]                  
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 384, 512, 16) 0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 384, 512, 16) 0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 384, 512, 16) 12560       activation_23[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, 384, 512, 16) 0           activation_24[0][0]              
                                                                 conv2d_24[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 768, 1024, 16 0           add_7[0][0]                      
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 768, 1024, 20 0           up_sampling2d_3[0][0]            
                                                                 add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 768, 1024, 20 80          concatenate_3[0][0]              
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 768, 1024, 20 0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 768, 1024, 8) 7848        activation_25[0][0]              
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 768, 1024, 8) 168         concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 768, 1024, 8) 32          conv2d_26[0][0]                  
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 768, 1024, 8) 32          conv2d_28[0][0]                  
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 768, 1024, 8) 0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 768, 1024, 8) 0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 768, 1024, 8) 3144        activation_26[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 768, 1024, 8) 0           activation_27[0][0]              
                                                                 conv2d_27[0][0]                  
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 768, 1024, 2) 18          add_8[0][0]                      
==================================================================================================
Total params: 1,550,378
Trainable params: 1,548,554
Non-trainable params: 1,824
__________________________________________________________________________________________________
